In [1]:
# Initialize Otter
import otter
grader = otter.Notebook("lab.ipynb")

# Lab 3 ‚Äì Merging and Pivoting

## Instructions

This Jupyter Notebook contains the statements of the problems and provides code and Markdown cells to display your answers to the problems. The notebook is *only* for displaying a readable version of your final answers. The coding will be done in an accompanying `lab.py` file that is imported into the current notebook, and **you will only submit that `lab.py` file**, not this notebook!

Some additional guidelines:
- **Labs will have both public tests and hidden tests.** The bulk of your grade will come from your scores on hidden tests, which you will only see on Gradescope after the assignment deadline.
- **Do not change the function names in the `lab.py` file!** The functions in the `lab.py` file are how your assignment is graded, and they are graded by their name. If you changed something you weren't supposed to, you can find the original code in the course GitHub repository.
- Notebooks are nice for testing and experimenting with different implementations before designing your function in your `lab.py` file. You can write code here, but make sure that all of your real work is in the `lab.py` file, since that's all you're submitting.
- You are encouraged to write your own additional helper functions to solve the lab, as long as they also end up in `lab.py`.

**To ensure that all of the work you want to submit is in `lab.py`, we've included a script named `lab-validation.py` in the lab folder. You shouldn't edit it, but instead, you should call it from the command line (e.g. the Terminal) to test your work.** More details on its usage are given at the bottom of this notebook.

**Importing code from `lab.py`**:

* Below, we import the `.py` file that's contained in the same directory as this notebook.
* We use the `autoreload` notebook extension to make changes to our `lab.py` file immediately available in our notebook. Without this extension, we would need to restart the notebook kernel to see any changes to `lab.py` in the notebook.
    - `autoreload` is necessary because, upon import, `lab.py` is compiled to bytecode (in the directory `__pycache__`). Subsequent imports of `lab` merely import the existing compiled python.

In [2]:
%load_ext autoreload
%autoreload 2

In [3]:
from lab import *

In [4]:
import os
import io
from pathlib import Path
import pandas as pd
import numpy as np

<div class="alert alert-block alert-danger" markdown="1">

**There are only two functions in this lab in which you may use a `for`-loop:**
- **`read_linkedin_survey` in Question 1.**
- **`read_student_surveys` in Question 2.**
    
**You may lose points if you use a `for`-loop or `while`-loop in any other question!**

</div>

## Part 1: Combining Data

### Question 1 ‚Äì Making Connections ü§ù

A group of students decided to send out a survey to their connections on LinkedIn. Each student asks 1000 of their connections for their first and last name, the company they currently work at, their job title, their email, and the university they attended.

**Your job is to combine all the data contained in the files `survey*.csv` (stored within the `data/responses` folder) into a single DataFrame. The number of files and the number of rows in each file may vary, so don't hardcode your answers!** To do so, implement the following two functions.

#### `read_linkedin_survey`

Complete the implementation of the function `read_linkedin_survey`, which takes in a Path for the directory where `survey*.csv` files are located and outputs a single DataFrame with six columns titled `'first name'`, `'last name'`, `'current company'`, `'job title'`, `'email'`, and `'university'` (in that order) containing the all of survey information from all the `.csv` files. Make sure to reset the index of the combined DataFrame before returning it so that the index is unique. When the function takes in an invalide directory it should raise a `FileNotFoundError`.

***Hints***:

- Take a look at a few of the files in the `responses` folder. You may have to do some data cleaning to combine the DataFrames!

- You can list the files in a directory using `.iterdir()`.

***Note***: Remember to use `Path()` to build file paths. Calling `.iterdir()` on a `Path()` object will automatically throw a `FileNotFoundError`.

<br>

#### `com_stats`

Complete the implementation of the function `com_stats`, which takes in a DataFrame returned by `read_linkedin_survey` and returns a list containing, in the following order: 
- The proportion of people who went to a university with the string `'Ohio'` in its name that have the string `'Programmer'` somewhere in their job title.
- The number of job titles that **end** with the exact string `'Engineer'`. Note that we're asking for the number of job titles, **not** the number of people!
- The job title that has the longest name (there are no ties).
- The number of people who have the word `'manager'` in their job title, uppercase or lowercase (`'Manager'`, `'manager'`, and `'mANAgeR'` should all count).

In [5]:
import pandas as pd

df1 = pd.read_csv("data/responses/survey1.csv")
df1.head()

,first name,last name,job title,email,current company,university
0,Marsh,Kyllford,Financial Analyst,mkyllford0@naver.com,"Abernathy, Brown and Stiedemann",Ganja State University
1,Igor,Greatex,Data Coordiator,igreatex1@phpbb.com,"Stiedemann, Eichmann and Will",Meikai University
2,Garrick,Truscott,Tax Accountant,gtruscott2@weather.com,Collins-Hintz,Saint Paul University
3,Eleanore,Sansam,Senior Quality Engineer,esansam3@pbs.org,Trantow and Sons,Universidad del Rosario
4,Laurent,Bagley,Financial Advisor,lbagley4@statcounter.com,Weissnat and Sons,St. Petersburg StateMechnikov Medical Academy

In [6]:
df1.columns

Index(['first name', 'last name', 'job title', 'email', 'current company',
       'university'],
      dtype='object')

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   first name       1000 non-null   object
 1   last name        1000 non-null   object
 2   job title        956 non-null    object
 3   email            1000 non-null   object
 4   current company  1000 non-null   object
 5   university       1000 non-null   object
dtypes: object(6)
memory usage: 47.0+ KB

In [8]:
df2 = pd.read_csv("data/responses/survey2.csv")
df2.head()

,CURRENT COMPANY,JOB TITLE,FIRST NAME,LAST NAME,EMAIL,UNIVERSITY
0,Harvey Inc,Safety Technician IV,Ardelia,Winspurr,awinspurr0@timesonline.co.uk,Universidad Aut√≥noma de Yucat√°n
1,Johnston-Hermann,Structural Engineer,Ileane,Balhatchet,ibalhatchet1@fastcompany.com,Technical University of Opole
2,Dibbert-Lemke,Human Resources Assistant III,Damita,Seamer,dseamer2@elegantthemes.com,Osaka City University
3,"Rutherford, Schiller and Skiles",Staff Accountant III,Krystal,Clerc,kclerc3@lulu.com,"DeVry Institute of Technology, Decatur"
4,"Luettgen, Anderson and Green",Automation Specialist III,Kirsti,Raithbie,kraithbie4@liveinternet.ru,University of Maryland Medicine

In [9]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CURRENT COMPANY  1000 non-null   object
 1   JOB TITLE        1000 non-null   object
 2   FIRST NAME       1000 non-null   object
 3   LAST NAME        1000 non-null   object
 4   EMAIL            949 non-null    object
 5   UNIVERSITY       1000 non-null   object
dtypes: object(6)
memory usage: 47.0+ KB

In [10]:
df3 = pd.read_csv("data/responses/survey3.csv")
df3.head()

,CURRENT_COMPANY,EMAIL,FIRST_NAME,LAST_NAME,JOB_TITLE,UNIVERSITY
0,"Herman, Robel and Krajcik",rmournian0@census.gov,Rock,Mournian,Software Engineer IV,Tokushima University
1,Parisian-Powlowski,hkollatsch1@mail.ru,Helena,Kollatsch,Information Systems Manager,Musashi University
2,Treutel and Sons,aweall2@flavors.me,Amalita,Weall,VP Accounting,University Konstantina Filozov in Nitra
3,D'Amore-Kiehn,egroucutt3@howstuffworks.com,Elvyn,Groucutt,Executive Secretary,Nizhny Novgorod State University
4,Pagac Group,sbiskupek4@go.com,Suzie,Biskupek,Electrical Engineer,University of Essex

In [11]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CURRENT_COMPANY  1000 non-null   object
 1   EMAIL            1000 non-null   object
 2   FIRST_NAME       1000 non-null   object
 3   LAST_NAME        1000 non-null   object
 4   JOB_TITLE        1000 non-null   object
 5   UNIVERSITY       915 non-null    object
dtypes: object(6)
memory usage: 47.0+ KB

In [12]:
df4 = pd.read_csv("data/responses/survey4.csv")
df4.head()

,current_Company,email,first_Name,last_Name,job_title,university
0,Brakus-Aufderhar,cplume0@merriam-webster.com,Charyl,Plume,Dental Hygienist,Universit√© Mohammed Ier
1,Stamm and Sons,fgregersen1@baidu.com,Filbert,Gregersen,Tax Accountant,Universitas Sam Ratulangi
2,"Jaskolski, Gulgowski and Corkery",lmeighan2@domainmarket.com,Lesli,Meighan,Graphic Designer,Sadat Institute of Higher Education
3,"Terry, Howell and Nitzsche",etop3@harvard.edu,Emory,Top,Actuary,Instituto Tecnol√≥gico de Aeron√°utica
4,"Mills, Reichel and Muller",fmackerness4@liveinternet.ru,Felike,Mackerness,Media Manager IV,Ungku Omar Premier Polytechnic

In [13]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   current_Company  1000 non-null   object
 1   email            1000 non-null   object
 2   first_Name       1000 non-null   object
 3   last_Name        1000 non-null   object
 4   job_title        1000 non-null   object
 5   university       920 non-null    object
dtypes: object(6)
memory usage: 47.0+ KB

In [14]:
df5 = pd.read_csv("data/responses/survey5.csv")
df5.head()

,email,first_Name,last_Name,job_title,university,current_Company
0,cpippin0@wordpress.org,Consuelo,Pippin,Dental Hygienist,Military University Shoumen,Mayert and Sons
1,agotts1@posterous.com,Amata,Gotts,Civil Engineer,Abo Akademi University,Padberg and Sons
2,gwarmisham2@techcrunch.com,Glori,Warmisham,Senior Developer,St. Vincent College,Bruen-Rosenbaum
3,blytle3@businessweek.com,Byron,Lytle,Developer IV,"University of the West Indies, Mona",Upton Inc
4,cswadlin4@drupal.org,Carolee,Swadlin,Librarian,Novosibirsk State University,Swift-Lemke

In [15]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   email            1000 non-null   object
 1   first_Name       1000 non-null   object
 2   last_Name        1000 non-null   object
 3   job_title        1000 non-null   object
 4   university       1000 non-null   object
 5   current_Company  965 non-null    object
dtypes: object(6)
memory usage: 47.0+ KB

In [16]:
responses = read_linkedin_survey("data/responses")
responses.head()
responses.columns

Index(['first name', 'last name', 'current company', 'job title', 'email',
       'university'],
      dtype='object')

In [17]:
responses.head()

,first name,last name,current company,job title,email,university
0,Marsh,Kyllford,"Abernathy, Brown and Stiedemann",Financial Analyst,mkyllford0@naver.com,Ganja State University
1,Igor,Greatex,"Stiedemann, Eichmann and Will",Data Coordiator,igreatex1@phpbb.com,Meikai University
2,Garrick,Truscott,Collins-Hintz,Tax Accountant,gtruscott2@weather.com,Saint Paul University
3,Eleanore,Sansam,Trantow and Sons,Senior Quality Engineer,esansam3@pbs.org,Universidad del Rosario
4,Laurent,Bagley,Weissnat and Sons,Financial Advisor,lbagley4@statcounter.com,St. Petersburg StateMechnikov Medical Academy

In [18]:
responses.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   first name       5000 non-null   object
 1   last name        5000 non-null   object
 2   current company  4965 non-null   object
 3   job title        4956 non-null   object
 4   email            4949 non-null   object
 5   university       4835 non-null   object
dtypes: object(6)
memory usage: 234.5+ KB

In [19]:
from pathlib import Path
import pandas as pd

for fp in sorted(Path("data/responses").glob("survey*.csv")):
    cols = pd.read_csv(fp, nrows=0).columns.tolist()
    print(fp.name, cols)

survey1.csv ['first name', 'last name', 'job title', 'email', 'current company', 'university']
survey2.csv ['CURRENT COMPANY', 'JOB TITLE', 'FIRST NAME', 'LAST NAME', 'EMAIL', 'UNIVERSITY']
survey3.csv ['CURRENT_COMPANY', 'EMAIL', 'FIRST_NAME', 'LAST_NAME', 'JOB_TITLE', 'UNIVERSITY']
survey4.csv ['current_Company', 'email', 'first_Name', 'last_Name', 'job_title', 'university']
survey5.csv ['email', 'first_Name', 'last_Name', 'job_title', 'university', 'current_Company']

In [20]:
stats = com_stats(responses)
stats

[np.float64(0.15384615384615385),
 13,
 'Business Systems Development Analyst',
 369]

In [21]:
# do not edit this cell -- it is needed for the tests
dirname = Path('data') / 'responses'
q1_out = read_linkedin_survey(dirname)
stats_out = com_stats(q1_out)

In [22]:
grader.check("q1")

q1 results: All test cases passed!

### Question 2 ‚Äì Survey Says... üë®‚Äçüë©‚Äçüëß‚Äçüë¶

Professor Aritra often sends out extra credit surveys asking students for their favorite animals, movies, and other favorite things. These surveys are stored in the `data/extra-credit-surveys` folder. Each file in that folder corresponds to a different survey question (except for `favorite1.csv`, which contains students' names and IDs).

Here's how extra credit works:
- Each student who has completed at least 50% of the survey questions receives 5 points of extra credit.
- If there is at least one survey question that at least 90% of the class answered (e.g. favorite animal), **everyone** in the class receives 1 point of extra credit. This overall class extra credit only applies twice, so if for example 95% of students answer the favorite color survey question and 91% answer the favorite animal survey question, and and 97% answer the favorite movie question, the entire class still receives 2 extra point as a class, not 3.
- Note that this means that the most extra credit any student can earn is 7 points.

#### `read_student_surveys`

Complete the implementation of the function `read_student_surveys` which takes in a Path describing the directory to a folder containing `favorite*.csv` files and outputs a DataFrame containing all of the survey data combined, indexed by student ID (a value 1-1000).

***Note***: Remember to use `Path()` to build file paths.


<br>

#### `check_credit`

Complete the implementation of the function `check_credit` which takes in a DataFrame returned by `read_student_surveys` and outputs a DataFrame indexed by student ID (a value 1-1000) with two columns:
- `'name'`, containing the name of each student, and
- `'ec'`, containing the number of extra credit points each student earned.

***Note***: For the genres survey, `'(no genres listed)'` does not count as a valid response for receiving extra credit.

In [23]:
df1 = pd.read_csv("data/extra-credit-surveys/favorite1.csv")
df1.head()

   id       name
0   1     Myrtia
1   2   Nathanil
2   3       Joni
3   4   Prentice
4   5  Claudette

In [24]:
df2 = pd.read_csv("data/extra-credit-surveys/favorite2.csv")
df2.head()

   id                                             movie
0   1                                               NaN
1   2                                               NaN
2   3  Glass-blower's Children, The (Glasbl√•sarns barn)
3   4                                               NaN
4   5                                               NaN

In [25]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      1000 non-null   int64
 1   movie   288 non-null    object
dtypes: int64(1), object(1)
memory usage: 15.8+ KB

In [26]:
df3 = pd.read_csv("data/extra-credit-surveys/favorite3.csv")
df3.head()

   id               genre
0   1  (no genres listed)
1   2         Documentary
2   3                 NaN
3   4  (no genres listed)
4   5                 NaN

In [27]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      1000 non-null   int64
 1   genre   728 non-null    object
dtypes: int64(1), object(1)
memory usage: 15.8+ KB

In [28]:
df4 = pd.read_csv("data/extra-credit-surveys/favorite4.csv")
df4.head()

   id                   animal
0   1  Long-crested hawk eagle
1   2             Euro wallaby
2   3            Brown brocket
3   4    Peccary, white-lipped
4   5          Capuchin, brown

In [29]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      1000 non-null   int64
 1   animal  794 non-null    object
dtypes: int64(1), object(1)
memory usage: 15.8+ KB

In [30]:
df5 = pd.read_csv("data/extra-credit-surveys/favorite5.csv")
df5.head()

   id plant
0   1   NaN
1   2   NaN
2   3   NaN
3   4   NaN
4   5   NaN

In [31]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      1000 non-null   int64
 1   plant   16 non-null     object
dtypes: int64(1), object(1)
memory usage: 15.8+ KB

In [32]:
df6 = pd.read_csv("data/extra-credit-surveys/favorite6.csv")
df6.head()

   id   color
0   1     Red
1   2   Khaki
2   3     Red
3   4  Yellow
4   5  Fuscia

In [33]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      1000 non-null   int64
 1   color   976 non-null    object
dtypes: int64(1), object(1)
memory usage: 15.8+ KB

In [53]:
surveys = read_student_surveys("data/extra-credit-surveys")
surveys.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 1 to 1000
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       1000 non-null   object
 1   favorite2  288 non-null    object
 2   favorite3  728 non-null    object
 3   favorite4  794 non-null    object
 4   favorite5  16 non-null     object
 5   favorite6  976 non-null    object
dtypes: object(6)
memory usage: 47.0+ KB

In [57]:
surveys.head()
#surveys.shape

NameError: name 'surveys' is not defined

In [52]:
valid_rates = pd.Series({
    c: (
        surveys[c].astype("string").notna()
        & (surveys[c].astype("string").str.strip() != "")
        & (
            ~surveys[c].astype("string").str.strip().eq("(no genres listed)")
            if "genre" in c.lower()
            else True
        )
    ).mean()
    for c in surveys.columns if c != "name"
}).sort_values(ascending=False)

valid_rates

favorite6    0.976
favorite4    0.794
favorite3    0.728
favorite2    0.288
favorite5    0.016
dtype: float64

In [58]:
surveys = read_student_surveys("data/extra-credit-surveys")
out = check_credit(surveys)
out["ec"].max()

np.int64(6)

In [59]:
surveys.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 1 to 1000
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       1000 non-null   object
 1   favorite2  288 non-null    object
 2   favorite3  728 non-null    object
 3   favorite4  794 non-null    object
 4   favorite5  16 non-null     object
 5   favorite6  976 non-null    object
dtypes: object(6)
memory usage: 47.0+ KB

In [60]:
pd.read_csv("data/extra-credit-surveys/favorite1.csv").head()

   id       name
0   1     Myrtia
1   2   Nathanil
2   3       Joni
3   4   Prentice
4   5  Claudette

In [61]:
credit = check_credit(surveys)
credit["ec"].max()

np.int64(6)

In [62]:
surveys = read_student_surveys("data/extra-credit-surveys")

# true answered counts (non-missing) per question
surveys.drop(columns=["name"]).notna().sum()

favorite2    288
favorite3    728
favorite4    794
favorite5     16
favorite6    976
dtype: int64

In [37]:
surveys["favorite6"].astype("string").str.strip().value_counts().head(10)

favorite6
Red          69
Yellow       59
Maroon       58
Blue         57
Fuscia       56
Purple       55
Pink         55
Goldenrod    54
Turquoise    53
Mauv         52
Name: count, dtype: Int64

In [63]:
(surveys["favorite6"].astype("string").str.strip() == "").sum()

np.int64(0)

In [64]:
surveys["favorite6"].isna().sum()

np.int64(24)

In [65]:
(surveys["favorite6"].astype("string").str.strip() == "").sum()

np.int64(0)

In [66]:
credit = check_credit(surveys)
credit.head()
credit["ec"].value_counts().sort_index()

ec
1    326
6    674
Name: count, dtype: int64

In [67]:
# do not edit this cell -- it is needed for the tests
dirname = Path('data') / 'extra-credit-surveys'
q2_out = read_student_surveys(dirname)
check_credit_out = check_credit(q2_out)

In [68]:
grader.check("q2")

q2 results:
    q2 - 1 result:
        ‚úÖ Test case passed

    q2 - 2 result:
        ‚úÖ Test case passed

    q2 - 3 result:
        ‚úÖ Test case passed

    q2 - 4 result:
        ‚úÖ Test case passed

    q2 - 5 result:
        ‚ùå Test case failed
        Trying:
            res = check_credit_out['ec'].max() == 6
        Expecting nothing
        ok
        Trying:
            bool(res)
        Expecting:
            False
        **********************************************************************
        Line 2, in q2 4
        Failed example:
            bool(res)
        Expected:
            False
        Got:
            True

In [57]:
out = check_credit(surveys)
out["ec"].max()

np.int64(7)

In [58]:
df1 = pd.read_csv("data/pets/Owners.csv")
df1.head()

,OwnerID,Name,Surname,StreetAddress,City,State,StateFull,ZipCode
0,6049,Debbie,Metivier,315 Goff Avenue,Grand Rapids,MI,Michigan,49503
1,2863,John,Sebastian,3221 Perry Street,Davison,MI,Michigan,48423
2,3518,Connie,Pauley,1539 Cunningham Court,Bloomfield Township,MI,Michigan,48302
3,3663,Lena,Haliburton,4217 Twin Oaks Drive,Traverse City,MI,Michigan,49684
4,1070,Jessica,Velazquez,3861 Woodbridge Lane,Southfield,MI,Michigan,48034

In [59]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   OwnerID        89 non-null     int64
 1   Name           89 non-null     object
 2   Surname        89 non-null     object
 3   StreetAddress  89 non-null     object
 4   City           89 non-null     object
 5   State          89 non-null     object
 6   StateFull      89 non-null     object
 7   ZipCode        89 non-null     int64
dtypes: int64(2), object(6)
memory usage: 5.7+ KB

In [60]:
df2 = pd.read_csv("data/pets/Pets.csv")
df2.head()

     PetID     Name    Kind  Gender  Age  OwnerID
0  J6-8562  Blackie     Dog    male   11     5168
1  Q0-2001   Roomba     Cat    male    9     5508
2  M0-2904    Simba     Cat    male    1     3086
3  R3-7551   Keller  Parrot  female    2     7908
4  P2-7342  Cuddles     Dog    male   13     4378

In [61]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   PetID    100 non-null    object
 1   Name     100 non-null    object
 2   Kind     100 non-null    object
 3   Gender   100 non-null    object
 4   Age      100 non-null    int64
 5   OwnerID  100 non-null    int64
dtypes: int64(2), object(4)
memory usage: 4.8+ KB

In [63]:
df3 = pd.read_csv("data/pets/ProceduresDetails.csv")
df3.head()

  ProcedureType  ProcedureSubCode  Description  Price
0   OFFICE FEES                 1  Office Call     32
1   OFFICE FEES                 2    Emergency    100
2   OFFICE FEES                 3         Reck     24
3      GROOMING                 1         Bath     15
4      GROOMING                 2     Flea Dip     15

In [ ]:
df3 = pd.read_csv("data/pets/ProceduresDetails.csv")
df3.head()

In [64]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41 entries, 0 to 40
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ProcedureType     41 non-null     object
 1   ProcedureSubCode  41 non-null     int64
 2   Description       41 non-null     object
 3   Price             41 non-null     int64
dtypes: int64(2), object(2)
memory usage: 1.4+ KB

In [5]:
df4 = pd.read_csv("data/pets/ProceduresHistory.csv")
df4.head()
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2284 entries, 0 to 2283
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   PetID             2284 non-null   object
 1   Date              2284 non-null   object
 2   ProcedureType     2284 non-null   object
 3   ProcedureSubCode  2284 non-null   int64
dtypes: int64(1), object(3)
memory usage: 71.5+ KB

In [26]:
out_03 = total_cost_per_city(owners, pets, procedure_history, procedure_detail)
out_03.head()
out_03.sum()   # total clinic cost across all cities

np.int64(2335)

In [29]:
out_03.head(20)

City
Ann Arbor               450
Bloomfield Township       0
Bridgman                  0
Bruce Crossing            0
Caro                      0
Center Line              10
Clam River                0
Commerce                 10
Davison                   0
Detroit                 305
Dutton                    0
East Lansing             40
Farmington                0
Farmington Hills         10
Flint                    15
Fremont                   0
Fruitport                 0
Grand Ledge               0
Grand Rapids           1240
Highland Park             0
Name: Price, dtype: int64

### Question 3 ‚Äì Paw Patrol üêæ

You are analyzing data from a veterinarian clinic. The datasets contain several types of information from the clinic, including its customers (pet owners), pets, available procedures, and procedure history. The column names are self-explanatory. These DataFrames are provided to you:
-  `owners` stores the customer information, where every `'OwnerID'` is unique (verify this yourself).
-  `pets` stores the pet information. Each pet belongs to a customer in `owners`.
-  `procedure_detail` contains a catalog of procedures that are offered by the clinic.
-  `procedure_history` has procedure records. Most procedures were given to a pet in `pets`.

Complete the implementation of the following three functions, which each ask you to answer a specific question.

#### `most_popular_procedure`

What is the most popular `'ProcedureType'` amongst all pets in the `pets` DataFrame? Complete the implementation of the function `most_popular_procedure`, which takes in two DataFrames, `pets` and `procedure_history`, and returns the name of the most popular `'ProcedureType'` as a string.

Note that some pets are registered but haven't had any procedures performed. Also, some pets that have had procedures done are not registered in `pets`.

<br>

#### `pet_name_by_owner`

What is the name of each customer's pet(s)? Complete the implementation of the function `pet_name_by_owner`, which takes in two DataFrames, `owners` and `pets`, and returns a Series whose index contains owner first names, and whose values are pet names as **strings**. If an owner has multiple pets, the value corresponding to that owner should instead be a **list of pet names as strings**.

Note that owner first names are not necessarily unique, and so the Series you return will not necessarily have a unique index.

<br>

#### `total_cost_per_city`

Note that the `owners` DataFrame has a `'City'` column, describing the city in which each pet owner and their pets live. How much did each city spend in total on procedures? Complete the implementation of the function `total_cost_per_city`, which takes in four DataFrames, `owners`, `pets`, `procedure_history`, and `procedure_detail`, and returns a Series indexed by `'City'` that describes the total amount that each city has spent on pets' procedures.

***Hint***: At some point, you may have to merge on multiple columns.

***Note***: Some owners may have never visited the veterinarian clinic in their city. This means some cities may have zero operational costs.

In [52]:
df = pd.read_csv("data/pets/ProceduresDetails.csv")
df.columns

Index(['ProcedureType', 'ProcedureSubCode', 'Description', 'Price'], dtype='object')

In [54]:
df_hist = pd.read_csv("data/pets/ProceduresHistory.csv")
df_hist.columns

Index(['PetID', 'Date', 'ProcedureType', 'ProcedureSubCode'], dtype='object')

In [6]:
df4['PetID'].nunique()

2261

In [20]:
pets.columns

Index(['PetID', 'Name', 'Kind', 'Gender', 'Age', 'OwnerID'], dtype='object')

In [7]:
def most_popular_procedure(pets, procedure_history):
    # keep only procedures for pets that exist in pets
    merged = procedure_history.merge(
        pets[["PetID"]],
        on="PetID",
        how="inner"
    )
    # most common ProcedureType
    return merged["ProcedureType"].value_counts().idxmax()

In [19]:
owners.columns

Index(['OwnerID', 'Name', 'Surname', 'StreetAddress', 'City', 'State',
       'StateFull', 'ZipCode'],
      dtype='object')

In [13]:
most_popular_procedure(pets, procedure_history)

'VACCINATIONS'

In [25]:
out_02 = pet_name_by_owner(owners, pets)
len(out_02), len(owners)

(89, 89)

In [43]:
product_name(sales)

Product   boat    book  hotel     pen   ruler
Name
Jones      NaN    30.0    NaN   300.0  3350.0
Smith      NaN  2200.0    NaN  2500.0  2100.0
Trump    700.0  1000.0  100.0   150.0     NaN

In [55]:
# do not edit this cell -- it is needed for the tests
pets_fp = Path('data') / 'pets' / 'Pets.csv'
procedure_history_fp =  Path('data') / 'pets' / 'ProceduresHistory.csv'
owners_fp = Path('data') / 'pets' / 'Owners.csv'
procedure_detail_fp = Path('data') / 'pets' / 'ProceduresDetails.csv'
pets = pd.read_csv(pets_fp)
procedure_history = pd.read_csv(procedure_history_fp)
owners = pd.read_csv(owners_fp)
procedure_detail = pd.read_csv(procedure_detail_fp)

out_01 = most_popular_procedure(pets, procedure_history)
out_02 = pet_name_by_owner(owners, pets)
out_03 = total_cost_per_city(owners, pets, procedure_history, procedure_detail)

In [56]:
grader.check("q3")

q3 results: All test cases passed!

## Part 2: Pivot Tables

### Question 4 ‚Äì Summarizing Sales üí∞

Recall that a pivot table allows you to aggregate the entries in a DataFrame based on two categorical columns. In this question, you are given a simple dataset, `data/sales.csv`, and are asked to solve a few problems using the `pivot_table` method. 

**We have provided outlines for the DataFrames you need to create, but yours may have a different number of rows and columns and different values.**

***Note***: If it helps, [here](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html) is another great resource that provides an overview of `pivot_table` with many examples from the Titanic dataset.


#### `average_seller`

Complete the implementation of the function `average_seller`, which takes in the `sales` DataFrame and returns a DataFrame that contains the average sales for each seller, indexed by `'Name'` and containing the column `'Average Sales'`. There should not be any `NaN`s.

***Note***: You may be able to implement `average_seller` without using `pivot_table`.

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Average Sales</th>
    </tr>
    <tr>
      <th>Name</th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Jones</th>
      <td>0</td>
    </tr>
    <tr>
      <th>Smith</th>
      <td>0</td>
    </tr>
    <tr>
      <th>Trump</th>
      <td>0</td>
    </tr>
  </tbody>
</table>

<br>

#### `product_name`

Complete the implementation of the function `product_name` that takes in the `sales` DataFrame and returns a DataFrame that contains the total sales for each product, indexed by `'Name'`. Do not fill in `NaN`s.

<table border="1" class="dataframe">
  <thead>
    <tr>
      <th>Product</th>
      <th>boat</th>
      <th>book</th>
      <th>hotel</th>
    </tr>
    <tr>
      <th>Name</th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Jones</th>
      <td>NaN</td>
      <td>0.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>Smith</th>
      <td>NaN</td>
      <td>0.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>Trump</th>
      <td>0.0</td>
      <td>0.0</td>
      <td>0.0</td>
    </tr>
  </tbody>
</table>

<br>

#### `count_product`

Complete the implementation of the function `count_product` that takes in the `sales` DataFrame and returns a DataFrame that contains the total number of items sold product-wise and name-wise per date. Replace `NaN`s with 0s. Don't reset the index after pivoting.

<table border="1" class="dataframe">
  <thead>
    <tr>
      <th></th>
      <th>Date</th>
      <th>01.01.2012</th>
      <th>02.20.2013</th>
      <th>02.25.2015</th>
    </tr>
    <tr>
      <th>Product</th>
      <th>Name</th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>boat</th>
      <th>Trump</th>
      <td>0</td>
      <td>0</td>
      <td>0</td>
    </tr>
    <tr>
      <th rowspan="3" valign="top">book</th>
      <th>Jones</th>
      <td>0</td>
      <td>1</td>
      <td>0</td>
    </tr>
    <tr>
      <th>Smith</th>
      <td>1</td>
      <td>0</td>
      <td>0</td>
    </tr>
    <tr>
      <th>Trump</th>
      <td>0</td>
      <td>0</td>
      <td>0</td>
    </tr>
    <tr>
      <th>hotel</th>
      <th>Trump</th>
      <td>0</td>
      <td>0</td>
      <td>0</td>
    </tr>
  </tbody>
</table>

<br>

#### `total_by_month`

Complete the implementation of the function `total_by_month` that takes in the `sales` DataFrame and returns a pivot table that contains the total sales name-wise, product-wise per month. Replace `NaN`s with 0s. Don't reset the index after pivoting.

<table border="1" class="dataframe">
  <thead>
    <tr>
      <th></th>
      <th>Month</th>
      <th>February</th>
      <th>January</th>
      <th>July</th>
      <th>March</th>
    </tr>
    <tr>
      <th>Name</th>
      <th>Product</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th rowspan="3" valign="top">Jones</th>
      <th>book</th>
      <td>0</td>
      <td>0</td>
      <td>0</td>
      <td>0</td>
    </tr>
    <tr>
      <th>pen</th>
      <td>0</td>
      <td>0</td>
      <td>0</td>
      <td>0</td>
    </tr>
    <tr>
      <th>ruler</th>
      <td>0</td>
      <td>0</td>
      <td>0</td>
      <td>0</td>
    </tr>
    <tr>
      <th rowspan="3" valign="top">Smith</th>
      <th>book</th>
      <td>0</td>
      <td>0</td>
      <td>0</td>
      <td>0</td>
    </tr>
    <tr>
      <th>pen</th>
      <td>0</td>
      <td>0</td>
      <td>0</td>
      <td>0</td>
    </tr>
    <tr>
      <th>ruler</th>
      <td>0</td>
      <td>0</td>
      <td>0</td>
      <td>0</td>
    </tr>
  </tbody>
</table>

In [36]:
sales = pd.read_csv("data/sales.csv")
sales.head()

    Name Product        Date  Total
0  Smith    book  01.01.2012    200
1  Jones     pen  02.20.2013    300
2  Trump   hotel  03.03.2015    100
3  Smith    book  05.10.2013   2000
4  Jones    book  02.20.2013     30

In [37]:
sales.columns

Index(['Name', 'Product', 'Date', 'Total'], dtype='object')

In [41]:
average_seller(sales)

       Average Sales
Name
Jones          920.0
Smith         1700.0
Trump          487.5

In [46]:
total_by_month(sales)

Month          February  January    July   March     May
Name  Product
Jones book         30.0      0.0     0.0     0.0     0.0
      pen         300.0      0.0     0.0     0.0     0.0
      ruler      3350.0      0.0     0.0     0.0     0.0
Smith book          0.0    200.0     0.0     0.0  2000.0
      pen           0.0   2500.0     0.0     0.0     0.0
      ruler         0.0      0.0  2100.0     0.0     0.0
Trump boat          0.0      0.0     0.0   700.0     0.0
      book          0.0      0.0     0.0  1000.0     0.0
      hotel         0.0      0.0     0.0   100.0     0.0
      pen           0.0      0.0     0.0   150.0     0.0

In [45]:
count_product(sales)

Date           01.01.2012  02.20.2013  02.25.2015  03.03.2015  03.30.2017  \
Product Name
boat    Trump         0.0         0.0         0.0         0.0         1.0
book    Jones         0.0         1.0         0.0         0.0         0.0
        Smith         1.0         0.0         0.0         0.0         0.0
        Trump         0.0         0.0         0.0         1.0         0.0
hotel   Trump         0.0         0.0         0.0         1.0         0.0
pen     Jones         0.0         1.0         0.0         0.0         0.0
        Smith         1.0         0.0         0.0         0.0         0.0
        Trump         0.0         0.0         0.0         1.0         0.0
ruler   Jones         0.0         1.0         1.0         0.0         0.0
        Smith         0.0         0.0         0.0         0.0         0.0

Date           05.10.2013  07.05.2014
Product Name
boat    Trump         0.0         0.0
book    Jones         0.0         0.0
        Smith         1.0         0.0
        Trump         0.0         0.0
hotel   Trump         0.0         0.0
pen     Jones         0.0         0.0
        Smith         0.0         0.0
        Trump         0.0         0.0
ruler   Jones         0.0         0.0
        Smith         0.0         1.0

In [47]:
# don't change this cell -- it is needed for the tests to work
fp = Path('data') / 'sales.csv'
sales = pd.read_csv(fp)
q4_average_seller_out = average_seller(sales)
q4_product_name_out = product_name(sales)
q4_product_count_out = count_product(sales)
q4_total_by_month_out = total_by_month(sales)

In [48]:
grader.check("q4")

q4 results: All test cases passed!

## Congratulations! You're done Lab 3! üèÅ

As a reminder, all of the work you want to submit needs to be in `lab.py`.

To ensure that all of the work you want to submit is in `lab.py`, we've included a script named `lab-validation.py` in the lab folder. You shouldn't edit it, but instead, you should call it from the command line (e.g. the Terminal) to test your work.

Once you've finished the lab, you should open the command line and run, in the directory for this lab:

```
python lab-validation.py
```

**This will run all of the `grader.check` cells that you see in this notebook, but only using the code in `lab.py` ‚Äì that is, it doesn't look at any of the code in this notebook. If all of your `grader.check` cells pass in this notebook but not all of them pass in your command line with the above command, then you likely have code in your notebook that isn't in your `lab.py`!**

You can also use `lab-validation.py` to test individual questions. For instance,

```
python lab-validation.py q1 q2 q4
```

will run the `grader.check` cells for Questions 1, 2, and 4 ‚Äì again, only using the code in `lab.py`. [This video](https://www.loom.com/share/0ea254b85b2745e59322b5e5a8692e91?sid=5acc92e6-0dfe-4555-9b6a-8115b6a52f99) how to use the script as well.

Once `python lab-validation.py` shows that you're passing all test cases, you're ready to submit your `lab.py` (and only your `lab.py`) to Gradescope. Once submitting to Gradescope, make sure to stick around until all test cases pass.

There is also a call to `grader.check_all()` below in _this_ notebook, but make sure to also follow the steps above.

<div class="alert alert-block alert-danger" markdown="1">

**There are only two functions in this lab in which you may use a `for`-loop:**
- **`read_linkedin_survey` in Question 1.**
- **`read_student_surveys` in Question 2.**
    
**You may lose points if you use a `for`-loop or `while`-loop in any other question!**

</div>